000100190305     A          R BALANCER
000200190305     A            ID            10A
000300190305     A            BALANCE       11P 2
000400190305     A          K ID
